In [37]:
import numpy as np
import pandas as pd

In [38]:
from numpy.random import randn   #used too generate random values

In [39]:
df=pd.DataFrame(randn(6,4),['A','B','C','D','E','F'],['W','X','Y','Z']) #(data,rows,column)

In [40]:
df.shape    #print number of rows and column

(6, 4)

In [41]:
df  #print data

          W         X         Y         Z
A  1.585813 -0.602180  1.366027 -0.252647
B -0.149208  1.625464 -0.687582  0.238406
C -0.656760  1.670518  2.330336  0.785300
D -0.680125 -1.438000  0.622534  0.004775
E -1.461264  2.049664 -0.550803 -0.170636
F -0.201326  0.592607 -0.657330 -1.231336

In [42]:
df.isnull().sum()   #print to check number of null value

W    0
X    0
Y    0
Z    0
dtype: int64

In [43]:
df.head()   #gives top 5 results

          W         X         Y         Z
A  1.585813 -0.602180  1.366027 -0.252647
B -0.149208  1.625464 -0.687582  0.238406
C -0.656760  1.670518  2.330336  0.785300
D -0.680125 -1.438000  0.622534  0.004775
E -1.461264  2.049664 -0.550803 -0.170636

In [44]:
df.head(2)   #print top 2 results

          W         X         Y         Z
A  1.585813 -0.602180  1.366027 -0.252647
B -0.149208  1.625464 -0.687582  0.238406

In [45]:
# df.head(1)
df.tail()

          W         X         Y         Z
B -0.149208  1.625464 -0.687582  0.238406
C -0.656760  1.670518  2.330336  0.785300
D -0.680125 -1.438000  0.622534  0.004775
E -1.461264  2.049664 -0.550803 -0.170636
F -0.201326  0.592607 -0.657330 -1.231336

In [46]:
df.head(1)
df.tail(2)

          W         X         Y         Z
E -1.461264  2.049664 -0.550803 -0.170636
F -0.201326  0.592607 -0.657330 -1.231336

In [47]:
df.tail()   #print last 5 values

          W         X         Y         Z
B -0.149208  1.625464 -0.687582  0.238406
C -0.656760  1.670518  2.330336  0.785300
D -0.680125 -1.438000  0.622534  0.004775
E -1.461264  2.049664 -0.550803 -0.170636
F -0.201326  0.592607 -0.657330 -1.231336

In [48]:
df['W']   # print all rows of column having value 'W'

A    1.585813
B   -0.149208
C   -0.656760
D   -0.680125
E   -1.461264
F   -0.201326
Name: W, dtype: float64

In [49]:
df.columns   #print all column

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [50]:
df.index   #print all index

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [51]:
df[['W','Z']]    #for printing multiple column

          W         Z
A  1.585813 -0.252647
B -0.149208  0.238406
C -0.656760  0.785300
D -0.680125  0.004775
E -1.461264 -0.170636
F -0.201326 -1.231336

In [52]:
df['new']=df['W']+df['Y']    #creating new column by adding values of existing column

In [53]:
df

          W         X         Y         Z       new
A  1.585813 -0.602180  1.366027 -0.252647  2.951840
B -0.149208  1.625464 -0.687582  0.238406 -0.836790
C -0.656760  1.670518  2.330336  0.785300  1.673576
D -0.680125 -1.438000  0.622534  0.004775 -0.057591
E -1.461264  2.049664 -0.550803 -0.170636 -2.012067
F -0.201326  0.592607 -0.657330 -1.231336 -0.858657

In [54]:
df.drop('E')     #only drop the selected row

          W         X         Y         Z       new
A  1.585813 -0.602180  1.366027 -0.252647  2.951840
B -0.149208  1.625464 -0.687582  0.238406 -0.836790
C -0.656760  1.670518  2.330336  0.785300  1.673576
D -0.680125 -1.438000  0.622534  0.004775 -0.057591
F -0.201326  0.592607 -0.657330 -1.231336 -0.858657

In [55]:
df

          W         X         Y         Z       new
A  1.585813 -0.602180  1.366027 -0.252647  2.951840
B -0.149208  1.625464 -0.687582  0.238406 -0.836790
C -0.656760  1.670518  2.330336  0.785300  1.673576
D -0.680125 -1.438000  0.622534  0.004775 -0.057591
E -1.461264  2.049664 -0.550803 -0.170636 -2.012067
F -0.201326  0.592607 -0.657330 -1.231336 -0.858657

In [56]:
df.drop('F',inplace=True)     #permanent drop for row
df

          W         X         Y         Z       new
A  1.585813 -0.602180  1.366027 -0.252647  2.951840
B -0.149208  1.625464 -0.687582  0.238406 -0.836790
C -0.656760  1.670518  2.330336  0.785300  1.673576
D -0.680125 -1.438000  0.622534  0.004775 -0.057591
E -1.461264  2.049664 -0.550803 -0.170636 -2.012067

row indexes are on axis 0, and column indexes are on axes 1

In [57]:
df.drop('W',axis=1,inplace=True)   #permanent drop for column
df

          X         Y         Z       new
A -0.602180  1.366027 -0.252647  2.951840
B  1.625464 -0.687582  0.238406 -0.836790
C  1.670518  2.330336  0.785300  1.673576
D -1.438000  0.622534  0.004775 -0.057591
E  2.049664 -0.550803 -0.170636 -2.012067

In [58]:
# df['A']
df.loc['A']      #show row data by name

X     -0.602180
Y      1.366027
Z     -0.252647
new    2.951840
Name: A, dtype: float64

In [59]:
df.iloc[3]   #show row data by its index

X     -1.438000
Y      0.622534
Z      0.004775
new   -0.057591
Name: D, dtype: float64

In [60]:
df.loc['B','Y']   #show multiple row data

-0.687581801906447

In [61]:
df.loc[['A','B'],['X','Y']]    #show data according to range of row and column respectively

          X         Y
A -0.602180  1.366027
B  1.625464 -0.687582

In [62]:
df>0     #gives true value for data having value greater than 0

       X      Y      Z    new
A  False   True  False   True
B   True  False   True  False
C   True   True   True   True
D  False   True   True  False
E   True  False  False  False

In [63]:
df[df>0]     #print values having value greater than 0

          X         Y         Z       new
A       NaN  1.366027       NaN  2.951840
B  1.625464       NaN  0.238406       NaN
C  1.670518  2.330336  0.785300  1.673576
D       NaN  0.622534  0.004775       NaN
E  2.049664       NaN       NaN       NaN

In [64]:
s=df[df>0]    #get value greater than 0
s['X']        #print values of column 'X' having value greater than 0

A         NaN
B    1.625464
C    1.670518
D         NaN
E    2.049664
Name: X, dtype: float64

In [65]:
s=df[df>0]['X'] #get values of column 'X' having value greater than 0
s               #print s

A         NaN
B    1.625464
C    1.670518
D         NaN
E    2.049664
Name: X, dtype: float64

In [66]:
df[df['Y']>0]['X'] #get rows in which value of column 'Y' is gerater than 0 and print those rows of 'X'

A   -0.602180
C    1.670518
D   -1.438000
Name: X, dtype: float64

In [67]:
s=df[df['Y']>0] #get rows in which value of column 'Y' is gerater than 0
s['X']          #print rows of 'X' in which rows of 'Y' is gerater than 0

A   -0.602180
C    1.670518
D   -1.438000
Name: X, dtype: float64

In [68]:
s=df[df['Y']>0]
s[['X','Z']]    #print muliple column

          X         Z
A -0.602180 -0.252647
C  1.670518  0.785300
D -1.438000  0.004775